Revit 2024 API
PushButtonData Methods
The PushButtonData type exposes the following members.
Methods
Name | Description
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetContextualHelp
Gets the contextual help bound with this control.
 (Inherited from RibbonItemData.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetContextualHelp
Sets the contextual help bound with this button data.
 (Inherited from RibbonItemData.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
PushButtonData Class
Autodesk.Revit.UI Namespace